{
    "questions" : [
        {
            "title" : "How many 0's",
            "content" : "You are part of a team of adventurers, exploring the aincent mayan ruines of El Castillo, also known as the Temple of Kukulkan. Things have been going well, however, you've gotten to a series of doors with integer values on them. One explorer speaks up and states that the key combination must be the total number of 0's within that integer, however, you are the only explorer who can figure out how many 0's are in the integer.",
            "input-type" : "The input is an integer n, between -2,000,000,000 and 2,000,000,000",
            "output-type" : "Output the total number of 0's that are in the given input integer",
            "test-cases" : [
                [1200350, 3],
                [2000000, 5],
                [12, 0]
            ]
        },
        {
            "title" : "Delimiters in integers",
            "content" : "You have recently taken on a postion as lead accountant at a company on the forbes top 500 list. As an accountant you often have to handle very large numbers, however one issue has stopped you: large numbers are hard to read. It is your job to add delimiters (commas in numbers) to all numbers the company asks for",
            "input-type" : "The input is an integer n, between -2,000,000,000 and 2,000,000,000",
            "output-type" : "Output a string, which contains n with delimiters seperating large numbers",
            "test-cases" : [
                [1200, "\"1,200\""],
                [524034, "\"524,034\""],
                [1253568423, "\"1,253,568,423\""]
            ]
        },
        {
            "title" : "UPC Validation",
            "content" : "The year is 3167, civilization has moved on into space and forgotten about earth. You are a historian on a mission to the United Sates Of America, on Earth, to learn information about products sold back in the early 2000's. In order to gain information on each product, you'll need to head back to the ship to scan it. To save time you've decided to create a program to check if a UPC is valid. To build the program, you've discovered the following information:\nA Universal Product Code is a numerical system created to identify barcodes within the US. A valid UPC is described as the following: A number containing 12 digits where each number, multiplied by the weights (3, 1, 3, 1 ...) respectively, whose sum is divisible by 10",
            "input-type" : "The input is a string code, with length 12, containing only digits",
            "output-type" : "Output a true if the code is a valid UPC, or false if otherwise",
            "test-cases" : [
                ["\"829576019311\"", "True"],
                ["\"134867295164\"", "False"],
                ["\"012000028632\"", "True"]
            ]
        },
        {
            "title" : "Common Factors",
            "content" : "Your math teacher has given you an assignment requiring you to find the total number of common factors between 2 numbers. You, being a brilliant computer scientist, realized that the fastest way to complete this assingment is to create a program that finds the total number of common factors for you",
            "input-type" : "The input is two integers, n and m, both are between 1 and 20,000",
            "output-type" : "Output the total number of common factors between n and m",
            "test-cases" : [
                ["12, 30", 4],
                ["5, 13", 1],
                ["20, 20", 6]
            ]
        },
        {
            "title" : "Array Rotator",
            "content" : "While working as a general in the Roman Empire, you've realized the importance of encrypting top secret millitary letters, containing battle strategies. In order to do so, you've created a way to take a list of characters, represented by a number value, and rotate them by some magic number that only you and your soldiers know. Your job is to create the algorithim to correctly rotate the list",
            "input-type" : "The input is an array of integers nums, where each integer is between -1000, 1000; and an integer rotate, between -100 and 100",
            "output-type" : "Output the given array with each integers index offset by rotate",
            "test-cases" : [
                ["[1, 2, 3, 4, 5, 6, 7], 4", "[4, 5, 6, 7, 1, 2, 3]"],
                ["[17, 4, 6], 2", "[4, 6, 17]"],
                ["[1], 20", "[1]"]
            ]
        },
        {
            "title" : "Product Divided By Sum",
            "content" : "Encrypting keys for end to end encryption has proven to be a the standard for most companies around the world. Many companies use many different algorithims. Skynet, the company you work for, has asked you to implement an algorithm that they have created. The algorithm is as follows:\n\nAn array of integers is given where array[0] is the total number of test cases. For each test case, check to see if the corresponding amount of numbers product is devisible by their sum. \nNOTE:array[0] should be included in the algorithm.",
            "input-type" : "The input is a list of integers, num; where num[0] denotes how many test cases will need to be run (num[0] will always be a multiple of the length of num), with each case having a unique combination of numbers",
            "output-type" : "Output an array of booleans, where each boolean is true, if the corresponding case's was true, or false if the case is false.",
            "test-cases" : [
                ["[3, 1, 2, 2, 4, 5]", "[false, true, false]"],
                ["[1, 7, 8, 5, 4]", "[false]"],
                ["[3, 2, 8]", "[true, true, true]"]
            ]
        },
        {
            "title" : "Primes",
            "content" : "You are a part of a reasearch team who's interested in prime numbers. You've been tasked with helping the team find the total number of primes between any two given numbers, inclusive.",
            "input-type" : "The input is two integers, n and m, both are between 1 and 50,000.",
            "output-type" : "Output an integer who's value is equal to the total number of primes between n and m.",
            "test-cases" : [
                ["7, 13", "2"],
                ["27, 104", "18"]
            ]
        },
        {
            "title" : "Anagram",
            "content" : "You are an english teacher trying to put together a lesson plan about anagrams for your 4th grade students. However, finding anagrams is difficult so you've decided to create a prorgam that can find out if two strings are anagrams of each other",
            "input-type" : "The input is two strings, word1 and word2.",
            "output-type" : "Output a boolean who's value is true if the words are anagrams of each other and false otherwise.",
            "test-cases" : [
                ["\"Race\", \"care\"", "true"],
                ["\"William Shakespeare\", \"I'll make a wise phrase\" ", "true"],
                ["\"Otterbein\", \"Other Time\"", "false"]
            ]
        },
        {
            "title" : "Stock Trader",
            "content" : "You are a high level stock trader working on wallstreet. A very wealthy man has asked you to trade his stocks for him. However, there are some rules: You can see 7 days into the future. Each day you may buy, sell, or hold. You can own at most 1 stock and cannot sell if you have no stocks. Find the most profitable combination of buying, selling, and holding.",
            "input-type" : "The input is an array of integers with length 7, where each integer corresponds to a stock price on that given day.",
            "output-type" : "Output an array of integers of length 7, where, on any given day, a 1 corresponds to buying, 0 corresponds to holding, and -1 corresponds to selling.",
            "test-cases" : [
                ["[100, 180, 260, 310, 40, 535, 695]", "[1, 0, 0, -1, 1, 0, -1]"]
            ]
        }


    ]
}